``` Terraform will perform the following actions:

  # aws_route53_record.beacon-galaxyproject will be created
  + resource "aws_route53_record" "beacon-galaxyproject" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "beacon.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "A"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # aws_route53_record.beacon-import-galaxyproject will be created
  + resource "aws_route53_record" "beacon-import-galaxyproject" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "beacon-import.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "A"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # openstack_blockstorage_volume_v2.beacon-vol will be created
  + resource "openstack_blockstorage_volume_v2" "beacon-vol" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "Data volume for beacon VM"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = (known after apply)
      + region            = (known after apply)
      + size              = 128
      + volume_type       = "default"
    }

  # openstack_compute_instance_v2.beacon will be created
  + resource "openstack_compute_instance_v2" "beacon" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.small"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "5a31b410-4f09-4b6c-84eb-eb16ca237f0a"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "beacon.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "bc3a2a5c3c8653edf62327dd46757658ec380db6"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.beacon-import will be created
  + resource "openstack_compute_instance_v2" "beacon-import" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.tiny"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "5a31b410-4f09-4b6c-84eb-eb16ca237f0a"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "beacon-import.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false
      + user_data           = "f1afc818d33a9c6c68d6c2dd4401f2e9abd7f8fc"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.beacon-va will be created
  + resource "openstack_compute_volume_attach_v2" "beacon-va" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

  # random_id.beacon-volume_name_unique will be created
  + resource "random_id" "beacon-volume_name_unique" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```